// From MacBuddy
// ---------------------------------------------------------------------
// * Buttons
// ---------------------------------------------------------------------
"OK_BUTTON"		= "OK";
"CANCEL_BUTTON"		= "Отменить";
"GOBACK_BUTTON"		= "Назад";
"DIAGNOSE_BUTTON"	= "Диагностика";

// ---------------------------------------------------------------------
// * Progress message
// ---------------------------------------------------------------------
"MESSAGE_CONFIGURING"		= "Настраиваю компьютер...";
"MESSAGE_PREP_CONNECTION"	= "Подготовка к подключению...";

// ---------------------------------------------------------------------
// * Fatal error
// ---------------------------------------------------------------------
"FATAL_ERROR_PANEL_TITLE"		= "Ошибка";
"MESSAGE_FATAL_ERROR_TITLE"		= "Произошла неожиданная ошибка.";

// ---------------------------------------------------------------------
// * Generic error
// ---------------------------------------------------------------------
"GENERIC_ERROR_PANEL_TITLE"				= "Ошибка";
"ERROR_MESSAGE_GENERIC_TITLE"			= "Извините...";


// ---------------------------------------------------------------------
// * Data Validation
// ---------------------------------------------------------------------
"ERROR_MESSAGE_VALIDATION_FAILED_TITLE" = "Извините";
"ERROR_MESSAGE_VALIDATION_WARNING_TITLE" = "Внимание";
"ERROR_MESSAGE_VALIDATION_WARNING" = "Хотите продолжить?";

                    // Required field
"ERROR_MESSAGE_VALIDATION_0001_TITLE" = "Вы не предоставили всю необходимую информацию.";
"ERROR_MESSAGE_VALIDATION_0001" = "Проверьте поля, отмеченные красными стрелками, и введите требуемую информацию.";

                    // Min-length field
"ERROR_MESSAGE_VALIDATION_0002_TITLE" = "Введенный текст слишком короткий.";
"ERROR_MESSAGE_VALIDATION_0002" = "Проверьте выделенные поля и исправьте введенный текст.";

                    // Matching fields (e.g. password)
"ERROR_MESSAGE_VALIDATION_0003" = "Введенная Вами информация неверна.";

                    // NI Username invalid
"ERROR_MESSAGE_VALIDATION_0004_TITLE" = "Введенное имя пользователя недействительно.";
"ERROR_MESSAGE_VALIDATION_0004" = "Проверьте выделенное поле и введите допустимое имя пользователя в сети NetInfo.";

                    // NI Password invalid
"ERROR_MESSAGE_VALIDATION_0005_TITLE" = "Вы ввели неверный пароль.";
"ERROR_MESSAGE_VALIDATION_0005" = "Проверьте выделенное поле и введите правильный пароль.";

                    // UnixName invalid		-- refer to UsersPref
"ERROR_MESSAGE_VALIDATION_0006_TITLE" = "Введенное имя неприменимо.";
"ERROR_MESSAGE_VALIDATION_0006" = "Проверьте выделенное поле и выберите другое сокращенное имя.";
"ERROR_MESSAGE_VALIDATION_0007" = "Уже есть пользователь с таким сокращенным именем. Выберите другое имя.";

                    // IPAddress invalid	-- refer to Open Transport
					// "ERROR_MESSAGE_VALIDATION_0008" - NSIPAddressIsValid
"ERROR_MESSAGE_VALIDATION_0009" = "Введенный IP-адрес пустой.";
"ERROR_MESSAGE_VALIDATION_0010" = "Введенный IP-адрес содержит неверные символы.";
"ERROR_MESSAGE_VALIDATION_0011_TITLE" = "Адрес должен содержать 4 сегмента."; // too few segments
"ERROR_MESSAGE_VALIDATION_0011" = "Проверьте выделенное поле и введите действительный адрес. Если он Вам неизвестен, обратитесь к администратору сети.";
"ERROR_MESSAGE_VALIDATION_0012_TITLE" = "Адрес должен содержать 4 сегмента."; // too many segments
"ERROR_MESSAGE_VALIDATION_0012" = "Проверьте выделенное поле и введите действительный адрес. Если он Вам неизвестен, обратитесь к администратору сети.";
"ERROR_MESSAGE_VALIDATION_0013_TITLE" = "Каждый сегмент адреса должен содержать от 1 до 3 символов."; // no segments
"ERROR_MESSAGE_VALIDATION_0013" = "Проверьте выделенное поле и введите действительный адрес. Если он Вам неизвестен, обратитесь к администратору сети.";
"ERROR_MESSAGE_VALIDATION_0014_TITLE" = "Введенный адрес не разрешен.";
"ERROR_MESSAGE_VALIDATION_0014" = "Проверьте выделенное поле и введите действительный адрес. Если он Вам неизвестен, обратитесь к администратору сети.";

                    // SubnetMask invalid
"ERROR_MESSAGE_VALIDATION_0015_TITLE" = "Введенная маска подсети недействительна.";
"ERROR_MESSAGE_VALIDATION_0015" = "Проверьте выделенное поле и введите действительную маску подсети. Если она Вам неизвестна, обратитесь к администратору сети.";

                    // notNIUsername
"ERROR_MESSAGE_VALIDATION_0016" = "Введенное имя уже существует в сети NetInfo. Вы не сможете войти в сеть NetInfo с этим именем.";

                    // Unique fields
"ERROR_MESSAGE_VALIDATION_0017" = "Одинаковое значение недопустимо.";

                    // Wireless Network password
"ERROR_MESSAGE_VALIDATION_0018" = "Введенный пароль недействителен.";

"ERROR_MESSAGE_VALIDATION_0019_TITLE" = "Введенный номер кредитной карты неприменим.";
"ERROR_MESSAGE_VALIDATION_0019" = "Проверьте выделенное поле и введите действительный номер кредитной карты.";

                    // Account name
"ERROR_MESSAGE_VALIDATION_0020" = "Имя учетной записи не может начинаться с числа.";

                    // EMail address
"ERROR_MESSAGE_VALIDATION_0021" = "Введенный адрес e-mail, возможно, неверен.";

                    // SubnetMask & IPAddress, Router consistency check
"ERROR_MESSAGE_VALIDATION_0022" = "IP-адрес и адрес маршрутизатора не соответствуют введенной маске подсети. Проверьте следующие поля и введите правильные значения:\n     IP-адрес\n     Маска подсети\n     Маршрутизатор\nЕсли Вам неизвестна эта информация, обратитесь к администратору сети.";

                    // Wrong long username
"ERROR_MESSAGE_VALIDATION_0023_TITLE" = "Введенное имя неприменимо.";
"ERROR_MESSAGE_VALIDATION_0023" = "Проверьте выделенное поле и выберите другое имя.";

                    // Unique Array
"ERROR_MESSAGE_VALIDATION_0024_TITLE" = "Есть дубликаты.";
"ERROR_MESSAGE_VALIDATION_0024" = "Проверьте выделенное поле и введите уникальные значения.";

// ---------------------------------------------------------------------
// * System Configuration
// ---------------------------------------------------------------------
"MESSAGE_NO_DIAL_TONE_TITLE"			= "Модем не может зафиксировать тон набора.";
"MESSAGE_NO_DIAL_TONE"					= "Убедитесь, что модем подключен, и нажмите кнопку «ОК». Либо нажмите «Отменить», чтобы вернуться назад и включить «Игнорировать тон набора».";

// ========== Network Setup Assistant addition ==========
"QUIT_BUTTON"		= "Завершить";
                                        // Field specific errors
"ERROR_PASSWORD_DO_NOT_MATCH_TITLE" = "Пароли не совпадают.";
"ERROR_PASSWORD_DO_NOT_MATCH" = "Проверьте поля, отмеченные красными стрелками, и введите одинаковый пароль в обоих полях.";

"ERROR_MUST_ENTER_LOCATION_NAME_TITLE" = "Введите имя размещения.";
"ERROR_MUST_ENTER_LOCATION_NAME" = "Вы создаете новое сетевое размещение с уже сохраненной конфигурацией. Необходимо ввести имя размещения.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME_TITLE" = "Введите другое имя размещения.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME" = "Введенное имя размещения уже существует. Введите другое имя.";


"MESSAGE_TASK_FORMAT" = "«%1$@ подключение через %2$@»"; // %1$@ = CONNECTION, %2$@ = CONFIGURATION
"CONNECTION_Wireless" = "Беспроводная сеть";
"CONNECTION_Modem" = "Модем";
"CONNECTION_DSL" = "DSL";
"CONNECTION_CableModem" = "Кабельный модем";
"CONNECTION_Lan" = "Локальная сеть";
"CONFIGURE_PPP" = "PPP";
"CONFIGURE_DHCP" = "DHCP";
"CONFIGURE_DHCPClientID" = "DHCP с ID клиента";
"CONFIGURE_PPPoE" = "PPPoE";
"CONFIGURE_Manual" = "Постоянный IP";

"MESSAGE_TITLE_CONFIGURE" = "Настраиваю...";
"MESSAGE_FAILED_CONFIGURE" = "Не удалось выполнить настройку.";
"MESSAGE_DONE_CONFIGURE" = "Закончил настройку.";
"MESSAGE_CHECKING_CONNECTION" = "Проверяю сетевое подключение...";
"MESSAGE_CONNECTED" = "Сетевое подключение установлено.";
"MESSAGE_NOT_CONNECTED" = "Не удается установить сетевое подключение.";
"MESSAGE_NOT_CONNECTED_TRY_AGAIN" = "Компьютер не может подключиться к Интернету. Нажмите кнопку «ОК», чтобы вернуться и изменить параметры сети, а затем повторить попытку.";

"DEFAULT_LOCATION_NAME" = "Размещение (%@)";
"DUPLICATE_LOCATION_NAME" = "%1$@ %2$d";